Repository: seanpm2001/mt-training-data
Catalog: sd/sd_pontoon.tmx
Source language: en_us
Languages: sd

source: This page gives you an overview of all your submitted sentences. You may also delete already submitted sentences if needed, by marking the checkbox next to it and clicking on &quot;Delete selected sentences&quot; at the bottom. Please only remove sentences if absolutely necessary, for example if you noticed after the fact that a sentence is copyright protected.
sd: هي صفحو توهان کي توهان جي سڀني پيش ڪيل جمعن جو هڪ جائزو ڏئي ٿو. جيڪڏهن ضرورت هجي ته توهان اڳ ۾ ئي جمع ٿيل جملن کي به حذف ڪري سگهو ٿا، ان جي اڳيان چيڪ باڪس کي نشانو بڻائيندي ۽ &quot;چونڊيل جملن کي حذف ڪريو&quot; تري ۾. مھرباني ڪري صرف جملن کي ختم ڪريو جيڪڏھن بلڪل ضروري آھي، مثال طور جيڪڏھن توھان ان حقيقت کان پوءِ نوٽيس ڪيو ته ھڪڙو جملو ڪاپي رائيٽ سان محفوظ آھي.

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
sd: هي سيٽنگ توهان جي ليڊر بورڊ جي نمائش کي ڪنٽرول ڪري ٿي. جڏهن لڪايو ويندو، توهان جي ترقي نجي هوندي. ان جو مطلب آهي توهان جي تصوير، صارف جو نالو ۽ ترقي ليڊر بورڊ تي ظاهر نه ٿيندي. نوٽ ڪريو ته ليڊربورڊ ريفريش ~{ $minutes } منٽ وٺن ٿا تبديلين کي ڀرڻ ۾.

source: Three to go!
sd: ٽي وڃڻ لاءِ!

source: Tibetan
sd: تبتي ٻولي

source: Tigre
sd: ٽيگري

source: Tigrinya
sd: ٽگرنيا

source: Today
sd: اڄ

source: Today's Common Voice progress on clips recorded
sd: رڪارڊ ٿيل ڪلپس تي اڄ جي عام آواز جي پيش رفت

source: Today's Common Voice progress on clips validated
sd: ڪلپس تي اڄ جي عام آواز پيش رفت جي تصديق ڪئي وئي آهي

source: Today's Progress
sd: اڄوڪي پيش رفت

source: Toki Pona
sd: ٽوڪي پونا

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
sd: ان کي ڪامن وائس ڊيٽا سيٽ ۾ آڻڻ لاءِ، هڪ وائيس ڪلپ کي ٻن الڳ استعمال ڪندڙن جي تصديق ٿيڻ گهرجي.

source: To make the Common Voice dataset as useful as possible we have decided to only allow source text that is available under a Creative Commons (CC0) license. Using the CC0 standard means its more difficult to find and collect source text, but allows anyone to use the resulting voice data without usage restrictions or authorization from Mozilla. Ultimately, we want to make the multi-language dataset as useful as possible to everyone, including researchers, universities, startups, governments, social purpose organizations, and hobbyists.
sd: ڪامن وائس ڊيٽا سيٽ کي ممڪن طور مفيد بڻائڻ لاءِ اسان فيصلو ڪيو آهي ته صرف ان ماخذ متن کي اجازت ڏيو جيڪو Creative Commons (CC0) لائسنس تحت موجود هجي. CC0 معيار کي استعمال ڪرڻ جو مطلب آهي ماخذ ٽيڪسٽ ڳولڻ ۽ گڏ ڪرڻ وڌيڪ ڏکيو آهي، پر ڪنهن کي به اجازت ڏئي ٿو ته نتيجي ۾ پيدا ٿيندڙ آواز ڊيٽا کي بغير استعمال جي پابندين يا Mozilla کان اجازت ڏيڻ جي. آخرڪار، اسان چاهيون ٿا ته گھڻ-ٻولي ڊيٽا سيٽ کي هر ڪنهن لاءِ جيترو ٿي سگهي ڪارآمد بڻائين، بشمول محقق، يونيورسٽيون، شروعاتي، حڪومتون، سماجي مقصد رکندڙ تنظيمون، ۽ شوق رکندڙ.

source: Too many files
sd: تمام گهڻيون فائلون

source: Top Contributors
sd: وڌيڪ حصو وٺندڙ

source: Total
sd: ڪُل

source: Total Approved
sd: مڪمل طور تي منظور ٿيل

source: { $totalInReview } sentences in review.
sd: { $totalInReview } جملا نظرثاني ۾.

source: { $totalSentences } total sentences.
sd: { $totalSentences } ڪُل جملا.

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
sd: ساڄي پاسي اسان فائدن کي بيان ڪريون ٿا ۽ واضح ڪريون ٿا ته اسان ڪهڙي معلومات کي عام ڪريون ٿا. پنھنجي ڊيوائس تي ڪامن وائس اڪائونٽ سان شروع ڪرڻ لاءِ ھيٺ ڏنل لنڪ استعمال ڪريو.

source: Toward next goal
sd: ايندڙ مقصد جي طرف

source: Track progress here and on your stats page.
sd: هتي ۽ توهان جي انگن اکرن واري صفحي تي پيش رفت کي ٽريڪ ڪريو.

source: Translate this page
sd: ھن صفحي جو ترجمو ڪريو

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
sd: <translateVideoLink>Pontoon کي ڪيئن استعمال ڪجي اسان جي گائيڊ ڏسو.</translateVideoLink>

source: Translating the site
sd: سائيٽ جو ترجمو

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
sd: ترجمو انگريزيءَ مان آهي، پر توهان ڏسي سگهو ٿا <strong>تجويزون</strong> ٻين ٻولين ۾. ڪلڪ ڪريو <strong>پروفائيل</strong> آئڪن، پوءِ <strong>سيٽنگون</strong> لنڪ ۽ شامل ڪريو جيڪي به ٻوليون توهان ڳالهايو ٿا. تري ساڄي هٿ ڪنڊ ۾ ترجمن جي هڪ فهرست هوندي جنهن کي <strong>Locales</strong> سڏيو ويندو آهي. ترجمو هڪ ڏينهن کان پوء سائيٽ تي ڏيکاري ٿو.

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
sd: Common Voice سائيٽ جو ترجمو <strong>Pontoon</strong> تي ٿئي ٿو.

source: Try again by dragging your file here
sd: ٻيهر ڪوشش ڪريو پنھنجي فائل کي ھتي ڇڪيندي

source: Try uploading again
sd: ٻيهر اپلوڊ ڪرڻ جي ڪوشش ڪريو

source: Tshivenda
sd: شيوينڊا

source: Turkish
sd: ترڪي

source: Turkmen
sd: ترڪماني

source: Tuvan
sd: تووان

source: Twi
sd: ٽوئِي

source: Typically megabytes
sd: عام ميگا بائيٽس

source: Ubykh
sd: اوبيخ

source: Udmurt
sd: ادمورت

source: Ukrainian
sd: يوڪريني

source: Understand contribution criteria
sd: سمجھو تعاون جي معيار

source: Understand how to contribute and validate sentences and audio clips to the Common Voice dataset
sd: سمجھو ته ڪامن وائس ڊيٽا سيٽ ۾ جملن ۽ آڊيو ڪلپس کي ڪيئن تعاون ۽ تصديق ڪجي

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
sd: سمجھو ته ڇا ڏسڻ گھرجي جڏھن وائس ڪلپس ٻڌڻ ۽ توھان جي آواز جي رڪارڊنگ کي بھتر بنائڻ ۾ مدد ڪريو!

source: Unexpected response returned from server
sd: سرور مان اڻڄاتل جواب واپس آيو

source: Unfortunately we can’t have Wikimedia articles yet. So do not copy paste from there.
sd: بدقسمتي سان اسان وٽ اڃان تائين وڪيپيڊيا تي مضمون نه آهن. تنهن ڪري اتان ڪاپي پيسٽ نه ڪريو.

source: Universities, Academics and Researchers
sd: يونيورسٽيون، تعليمي ۽ محقق

source: { $unreviewedSentencesByYou } sentences left for you to review.
sd: { $unreviewedSentencesByYou } جملا توھان جي نظرثاني لاءِ ڇڏيا ويا آھن.

source: Updating…
sd: تازه ڪاري…

source: Upload aborted. Do you want to delete your recordings?
sd: اپ لوڊ کي روڪيو ويو. ڇا توھان پنھنجي رڪارڊنگ کي ختم ڪرڻ چاھيو ٿا؟

source: Upload an image file
sd: هڪ تصوير فائل اپ لوڊ ڪريو

source: Upload failed, please retry.
sd: اپلوڊ ناڪام ٿيو، مهرباني ڪري ٻيهر ڪوشش ڪريو.

source: Upload <icon></icon> public domain sentences
sd: اپ لوڊ ڪريو <icon></icon> عوامي ڊومين جا جملا

source: Upload in progress...
sd: اپ لوڊ جاري آهي...

source: Upload more sentences?
sd: وڌيڪ جملا اپ لوڊ ڪريو؟

source: Upload of this clip keeps failing at server. Reload the page or try again later.
sd: هن ڪلپ جي اپ لوڊ سرور تي ناڪام ٿي رهي آهي. صفحي کي ٻيهر لوڊ ڪريو يا بعد ۾ ٻيهر ڪوشش ڪريو.

source: Upload of this clip keeps failing, keep retrying?
sd: هن ڪلپ جي اپلوڊ ناڪام ٿي رهي آهي، ٻيهر ڪوشش ڪريو؟

source: Urdu
sd: اردو

source: Use correct grammar
sd: درست گرامر استعمال ڪريو

source: Use correct spelling and punctuation
sd: درست اسپيلنگ ۽ اوقاف استعمال ڪريو

source: User Name
sd: استعمال ڪندڙ جو نالو

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
sd: صارفين عطيو ڪيل ڪلپس جي درستگي جي تصديق ڪئي، چڪاس ڪيو ته اسپيڪر جملي کي صحيح طور تي پڙهي.

source: Using Common Voice
sd: عام آواز استعمال ڪندي

source: Uyghur
sd: ويگر

source: Uzbek
sd: ازبڪ

source: Validated Clips
sd: تصديق ٿيل ڪلپس

source: Validated Hours
sd: تصديق ٿيل ڪلاڪ

source: Validated Hr. Total
sd: تصديق ٿيل ڪُل ڪلاڪ.

source: { $validatedSentences } validated sentences.
sd: { $validatedSentences } تصديق ٿيل جملا.

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
sd: عطيو ڪيل ڪلپس جي تصديق ڪرڻ عام آواز جي مشن لاءِ پڻ ضروري آهي. ٻڌو ۽ اسان جي مدد ڪريو معياري اوپن سورس وائس ڊيٽا ٺاهڻ ۾.

source: Validation Progress
sd: تصديق جي پيش رفت

source: Validations
sd: تصديقون

source: Value and recognition.
sd: قدر ۽ سڃاڻپ.

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
sd: متغيرات هڪ ٻوليءَ جو هڪ مخصوص روپ آهن - مثال طور جيڪي جغرافيائي يا ڪميونٽي ۾ رهندڙن طرفان ونڊيا وڃن ٿا. ڪڏھن ڪڏھن اھي ڳالھيون به سڏجن ٿيون.

source: Varying Pronunciations
sd: مختلف تلفظ

source: Venetian
sd: وينيٿين

source: Version
sd: نسخو

source: Very common mistakes include:
sd: تمام عام غلطيون شامل آھن:

source: Vietnamese
sd: ويٽنامي

source: View your progress against personal and project goals.
sd: ذاتي ۽ منصوبي جي مقصدن جي خلاف توهان جي پيشرفت ڏسو.

source: Visible
sd: ظاهر

source: Voice clips are entered into a submission queue that readies them for listening.
sd: وائس ڪلپس جمع ٿيل قطار ۾ داخل ڪيا ويا آھن جيڪي انھن کي ٻڌڻ لاء پڙھندا آھن.

source: Voice Collection
sd: آواز جو مجموعو

source: Voice Contribution
sd: آواز جو تعاون

source: Voice Dataset, Ready for Download
sd: وائس ڊيٽا سيٽ، ڊائون لوڊ لاءِ تيار

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
sd: آواز قدرتي آهي، آواز انساني آهي. ان ڪري اسان قابل استعمال آواز ٽيڪنالاجي ٺاهڻ جي باري ۾ پرجوش آهيون اسان جي مشينن لاء. پر آواز سسٽم ٺاهڻ لاء، ڊولپرز کي آواز ڊيٽا جي وڏي مقدار جي ضرورت آهي.

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
sd: آواز قدرتي آهي، آواز انساني آهي. ان ڪري اسان کي قابل استعمال آواز ٺاهڻ جي دلچسپي آهي اسان جي مشينن لاء ٽيڪنالاجي. پر آواز سسٽم ٺاهڻ لاء، آواز جو هڪ تمام وڏو مقدار ڊيٽا جي ضرورت آهي.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Common Voice is part of Mozilla’s initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language.
sd: آواز جي سڃاڻڻ واري ٽيڪنالاجي اسان جي مشينن سان لهه وچڙ جي طريقي سان انقلاب آڻيندي آهي، پر في الحال دستياب سسٽم قيمتي ۽ ملڪيت وارا آهن. Common Voice Mozilla جي شروعات جو حصو آھي آواز جي سڃاڻڻ واري ٽيڪنالاجيز کي بھتر ۽ سڀني لاءِ وڌيڪ رسائي لائق بنائڻ لاءِ. Common Voice عطيو ڪيل آوازن جو هڪ وڏو عالمي ڊيٽابيس آهي جيڪو هر ڪنهن کي جلدي ۽ آسانيءَ سان آواز-فعال ٿيل ايپس کي ممڪن طور تي هر ٻوليءَ ۾ تربيت ڏئي ٿو.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Mozilla Common Voice is an initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language. We're not only collecting voice samples in widely spoken languages but also in those with a smaller population of speakers. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and communities to address this gap themselves.
sd: آواز جي سڃاڻڻ واري ٽيڪنالاجي اسان جي مشينن سان لهه وچڙ جي طريقي سان انقلاب آڻيندي آهي، پر في الحال دستياب سسٽم قيمتي ۽ ملڪيت وارا آهن. Mozilla Common Voice آواز جي سڃاڻڻ واري ٽيڪنالاجيز کي بهتر ۽ هر ڪنهن لاءِ وڌيڪ رسائي لائق بنائڻ لاءِ هڪ شروعات آهي. Common Voice عطيو ڪيل آوازن جو هڪ وڏو عالمي ڊيٽابيس آهي جيڪو هر ڪنهن کي جلدي ۽ آسانيءَ سان وائيس-فعال ٿيل ايپس کي ممڪن طور تي هر ٻوليءَ ۾ تربيت ڏئي ٿو. اسان نه رڳو آوازن جا نمونا گڏ ڪري رهيا آهيون - وڏي پيماني تي ڳالهائيندڙ ٻولين ۾ پر انهن ۾ پڻ جيڪي ڳالهائيندڙن جي ننڍي آبادي سان. آوازن جي هڪ متنوع ڊيٽا سيٽ کي شايع ڪرڻ ڊولپرز، انٽرپرينيوئرز ۽ ڪميونٽيز کي بااختيار بڻائيندو ته جيئن هن خال کي پاڻ پتوڙي سگهي.

source: Voices Online Now
sd: آواز آن لائن ھاڻي

source: Voice Validation
sd: آواز جي تصديق

source: Volume
sd: مقدار

source: Votic
sd: ووٽڪ

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
sd: VoxForge کي مفت ۽ اوپن سورس اسپيچ سڃاڻپ انجڻ سان استعمال ڪرڻ لاءِ نقل ڪيل تقرير گڏ ڪرڻ لاءِ قائم ڪيو ويو.

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
sd: عام آواز کي به بهتر بنائڻ ۾ مدد ڪرڻ چاهيو ٿا؟ زبردست! اي ميل ذريعي رابطو ڪريو يا <discourseLink>Discourse</discourseLink> فورمز، سائيٽ جي مسئلن کي <githubLink>GitHub</githubLink> ذريعي جمع ڪريو، يا شامل ٿيو <matrixLink>Matrix</matrixLink> ڪميونٽي چيٽ.

source: Want to save your information? <createProfile>Create a profile</createProfile>
sd: توھان جي معلومات محفوظ ڪرڻ چاھيو ٿا؟ <createProfile>پروفائل ٺاھيو</createProfile>

source: Want to stay in touch with Common Voice?
sd: عام آواز سان رابطي ۾ رهڻ چاهيو ٿا؟

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
sd: تازه ڪاريون چاھيون ٿا جڏھن اسان ڪامن وائس ڊيٽا سيٽ جو نئون نسخو جاري ڪريون؟ اسان جي نيوز ليٽر جي رڪنيت حاصل ڪريو.

source: Watch our video explainer to help
sd: مدد لاءِ اسان جو وڊيو وضاحت ڪندڙ ڏسو

source: We are always looking to hear from data consumers about their needs and context - from collaborating on data collection platform to providing data health insights, we want to <emailFragment>hear from you.</emailFragment>
sd: اسان هميشه ڊيٽا صارفين کان انهن جي ضرورتن ۽ حوالي سان ٻڌڻ جي ڪوشش ڪندا آهيون - ڊيٽا گڏ ڪرڻ واري پليٽ فارم تي تعاون ڪرڻ کان وٺي ڊيٽا جي صحت جي بصيرت مهيا ڪرڻ تائين، اسان چاهيون ٿا ته <emailFragment>توھان کان ٻڌڻ.</emailFragment>

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
sd: اسان آوازن جو هڪ کليل ۽ عوامي طور تي دستياب ڊيٽا سيٽ ٺاهي رهيا آهيون جنهن کي هرڪو استعمال ڪري سگهي ٿو تقرير-فعال ٿيل ايپليڪيشنن کي تربيت ڏيڻ لاءِ.

source: We are excited to support public sector engagement in technology, innovation and language rights. If you're planning to run a major project or campaign, please do <emailFragment>get in touch.</emailFragment>
sd: اسان ٽيڪنالاجي، جدت ۽ ٻولي جي حقن ۾ عوامي شعبي جي مصروفيت جي حمايت ڪرڻ لاء پرجوش آهيون. جيڪڏهن توهان هڪ وڏو پروجيڪٽ يا مهم هلائڻ جي رٿابندي ڪري رهيا آهيو، مهرباني ڪري ڪريو <emailFragment>رابطي ۾ اچو.</emailFragment>

source: We are going out to get a coffee.
sd: اسان ٻاهر وڃي رهيا آهيون ڪافي وٺڻ لاءِ.

source: We are going out to get coffee.
sd: اسان ڪافي وٺڻ لاءِ ٻاهر وڃي رهيا آهيون.

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
sd: اسان Mozilla تي آواز ٽيڪنالاجي جي چوڌاري هڪ برادري جوڙي رهيا آهيون. اسان تازه ڪارين، نئين ڊيٽا جي وسيلن سان رابطي ۾ رهڻ چاهيون ٿا ۽ اڃا وڌيڪ ٻڌڻ لاءِ ته توهان هن ڊيٽا کي ڪيئن استعمال ڪري رهيا آهيو

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
sd: اسان يقين رکون ٿا ته وڏي ۽ عوامي طور تي دستياب آواز ڊيٽا سيٽ مشين جي سکيا تي ٻڌل تقرير ٽيڪنالاجي ۾ جدت ۽ صحتمند تجارتي مقابلي کي فروغ ڏين ٿا. هي هڪ عالمي ڪوشش آهي ۽ اسان سڀني کي شرڪت جي دعوت ڏيون ٿا. اسان جو مقصد تقرير ٽيڪنالاجي کي وڌيڪ شامل ڪرڻ ۾ مدد ڏيڻ آهي، دنيا جي آوازن جي تنوع کي ظاهر ڪندي.

source: We believe that large, publicly available voice datasets will foster innovation and healthy commercial competition in machine-learning based speech technology. Common Voice’s multi-language dataset is already the largest publicly available voice dataset of its kind, but it’s not the only one. Look to this page as a reference hub for other open source voice datasets and, as Common Voice continues to grow, a home for our release updates.
sd: اسان يقين رکون ٿا ته وڏي، عوامي طور تي دستياب آواز ڊيٽا سيٽ مشين جي سکيا تي ٻڌل تقرير ٽيڪنالاجي ۾ جدت ۽ صحتمند تجارتي مقابلي کي فروغ ڏيندو. Common Voice جي گھڻن ٻولين واري ڊيٽا سيٽ اڳ ۾ ئي پنھنجي قسم جو سڀ کان وڏو عوامي طور تي دستياب وائس ڊيٽا سيٽ آھي، پر اھو واحد نه آھي. هن صفحي کي ڏسو هڪ ريفرنس مرڪز جي طور تي ٻين اوپن سورس وائس ڊيٽا سيٽن لاءِ ۽، جيئن عام آواز وڌندو رهي ٿو، اسان جي رليز اپڊيٽ لاءِ هڪ گهر.

source: Website Localization
sd: ويب سائيٽ Localization

source: Websites
sd: ويب سائيٽون

source: We calculate hours by estimating the average length of each recording, and then multiplying that number by the total number of recordings across all languages.
sd: اسان ڪلاڪن جي حساب سان هر رڪارڊنگ جي سراسري ڊيگهه جو اندازو لڳائي، ۽ پوءِ ان انگ کي ضرب ڪريون ٿا سڀني ٻولين ۾ رڪارڊنگ جي ڪل تعداد سان.

source: We could not fetch the stats. Please try again later.
sd: اسان انگ اکر حاصل نه ڪري سگهياسين. مهرباني ڪري ڪجھہ دير رکي ٻيهر ڪوشش ڪندا.

source: We couldn’t find that page for you
sd: اسان توهان لاءِ اهو صفحو ڳولي نه سگهياسين

source: We couldn’t get any audio clips for you to listen to. Please try again later.
sd: اسان توهان کي ٻڌڻ لاءِ ڪي به آڊيو ڪلپس حاصل نه ڪري سگهيا آهيون. مهرباني ڪري بعد ۾ ٻيهر ڪوشش ڪريو.

source: We couldn’t get any sentences for you to speak. Please try again later.
sd: اسان توهان کي ڳالهائڻ لاءِ ڪو به جملو حاصل نه ڪري سگهياسين. مهرباني ڪري ڪجھہ دير رکي ٻيهر ڪوشش ڪندا.

source: Weekly
sd: هفتيوار

source: Weekly Goal
sd: هفتيوار مقصد

source: We failed to fetch available languages. Contributions are currently not possible. Please try again later.
sd: اسان دستياب ٻولين کي آڻڻ ۾ ناڪام ٿياسين. تعاون في الحال ممڪن ناهي. مهرباني ڪري بعد ۾ ٻيهر ڪوشش ڪريو.

source: We launch the Common Voice site in this language.
sd: اسان هن ٻولي ۾ عام آواز جي سائيٽ شروع ڪندا آهيون.

source: Welcome { $company } staff!
sd: ڀلي ڪري آيا { $company } اسٽاف!

source: Welcome to Common Voice
sd: عام آواز ۾ ڀليڪار

source: Welcome to the Common Voice Sentence Collector
sd: عام آواز جي جملا گڏڪندڙ ۾ ڀليڪار

source: Welsh
sd: ويلش ٻولي

source: We may have run out of clips - refresh the page, or try again later.
sd: اسان وٽ شايد ڪلپس ختم ٿي چڪيون آهن - صفحي کي ريفريش ڪريو، يا بعد ۾ ڪوشش ڪريو.

source: We may not have received that request. Please email us directly on <emailLink>{ $email }</emailLink> and we will get back to you!
sd: اسان کي شايد اها درخواست نه ملي آهي. مهرباني ڪري اسان کي سڌو سنئون اي ميل ڪريو <emailLink>{ $email }</emailLink> تي ۽ اسان توهان ڏانهن واپس اينداسين!

source: We prefer natural/conversational sentences. While phonetic diversity and different words in sentences is important, we are trying to make recording sentences as much fun as possible. Therefore it would be great if you could try to keep your sentences as natural/engaging as possible.
sd: اسان قدرتي/ڳالهائيندڙ جملن کي ترجيح ڏيون ٿا. جڏهن ته صوتياتي تنوع ۽ جملن ۾ مختلف لفظن اهم آهن، اسان ڪوشش ڪري رهيا آهيون ته رڪارڊنگ جملن کي ممڪن حد کان وڌيڪ مزو ڏيو. تنهن ڪري اهو تمام سٺو ٿيندو جيڪڏهن توهان ڪوشش ڪري سگهو ته توهان جي جملن کي ممڪن طور تي قدرتي / مشغول رکڻ جي ڪوشش ڪريو.

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
sd: اسان توهان جي معلومات کي احتياط سان سنڀالڻ جو واعدو ڪيون ٿا. وڌيڪ پڙهو اسان جي <privacyLink>رازداري نوٽيس</privacyLink>.

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
sd: اسان هڪ کليل ذريعو ٺاهي رهيا آهيون، آوازن جي گھڻ-ٻولي ڊيٽا سيٽ جيڪا هرڪو استعمال ڪري سگهي ٿو تقرير-فعال ٿيل ايپليڪيشنن کي تربيت ڏيڻ لاءِ.

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
sd: اسان آوازن جي هڪ اوپن سورس ڊيٽا سيٽ ڪري رهيا آهيون. پنهنجو آواز ڏيو، ٻين ماڻهن جي ڪلپس جي درستگي کي درست ڪريو، ڊيٽا سيٽ کي هر ڪنهن لاءِ بهتر بڻايو.

source: We’re experiencing unexpected downtime
sd: اسان اڻڄاتل بند وقت جو تجربو ڪري رهيا آهيون

source: We're going out to get coffee.
sd: اسان ٻاهر وڃي رهيا آهيون ڪافي وٺڻ لاءِ.

source: We’re going out to get coffee.
sd: اسان ٻاهر وڃي رهيا آهيون ڪافي وٺڻ لاءِ.

source: We release the dataset every 3 months.
sd: اسان ڊيٽا سيٽ کي هر 3 مهينن ۾ جاري ڪندا آهيون.

source: We're making some big changes
sd: اسان ڪجهه وڏيون تبديليون ڪري رهيا آهيون

source: We're receiving a lot of traffic and are currently investigating the issues.
sd: اسين تمام گھڻي آمد و رفت جي ڪري هن وقت مسئلن جي جاچ ڪري رهيا آهيون.

source: We’re sorry, your platform is not currently supported.
sd: اسان کي معاف ڪجو، توهان جو پليٽ فارم في الحال سپورٽ نه ٿو ڪري.

source: Western Sierra Puebla Nahuatl
sd: مغربي سيرا پيبلا نوهاٽلا

source: We use a Mozilla tool called <pontoonLink>Pontoon</pontoonLink> for translations. Pontoon has lots of languages, but if it doesn’t have yours you can <pontoonRequestLink>request for your language to be added</pontoonRequestLink>. Then, to make the language available on the Common Voice project, <githubRepoLink>request the new language on GitHub</githubRepoLink>. <localizationFragment>See more on site translation</localizationFragment>.
sd: اسان ترجمن لاءِ موزيلا ٽول استعمال ڪندا آهيون جنهن کي <pontoonLink>Pontoon</pontoonLink> سڏيو ويندو آهي. پونٽون ۾ ڪيتريون ئي ٻوليون آهن، پر جيڪڏهن اهو توهان جي نه آهي ته توهان ڪري سگهو ٿا <pontoonRequestLink>پنهنجي ٻولي شامل ڪرڻ جي درخواست</pontoonRequestLink>. ان کان پوء، ٻولي کي عام آواز پروجيڪٽ تي دستياب ڪرڻ لاء، <githubRepoLink> GitHub تي نئين ٻولي جي درخواست ڪريو </githubRepoLink>. <localizationFragment>سائيٽ جي ترجمي تي وڌيڪ ڏسو</localizationFragment>.

source: We’ve made some changes. Delta Segments just contain the most recent clips since the last release. <deltaLink>Read more about this work</deltaLink>.
sd: اسان ڪجھ تبديليون ڪيون آھن. ڊيلٽا حصا صرف آخري رليز کان وٺي سڀ کان تازي ڪلپس تي مشتمل آهن. <deltaLink>هن ڪم بابت وڌيڪ پڙهو</deltaLink>.

source: We've run out of sentences to record in this language...
sd: هن ٻولي ۾ رڪارڊ ڪرڻ لاءِ اسان وٽ جملا ختم ٿي ويا آهن...

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
sd: اسان چاهيون ٿا ته تقرير جا ماڊل بهتر هجن ته ڳالهائيندڙن جي مختلف رينج کي سمجهڻ ۾. ائين ٿيڻ لاءِ، هڪ آواز ڊيٽا سيٽ کي ڪيترن ئي مختلف ماڻهن جي نمائندگي ڪرڻ گهرجي.

source: We want the Common Voice dataset to reflect the audio quality a speech-to-text engine will hear in the wild, so we’re looking for variety. In addition to a diverse community of speakers, a dataset with varying audio quality will teach the speech-to-text engine to handle various real-world situations, from background talking to car noise. As long as your voice clip is intelligible, it should be good enough for the dataset.
sd: اسان چاهيون ٿا ته عام آواز ڊيٽا سيٽ آڊيو معيار کي ظاهر ڪري هڪ تقرير کان ٽيڪسٽ انجڻ رڻپٽ ۾ ٻڌندو، تنهنڪري اسان مختلف قسم جي ڳولا ڪري رهيا آهيون. ڳالهائيندڙن جي متنوع ڪميونٽي کان علاوه، مختلف آڊيو معيار سان گڏ هڪ ڊيٽا سيٽ تقرير کان ٽيڪسٽ انجڻ کي مختلف حقيقي دنيا جي حالتن کي سنڀالڻ سيکاريندو، پس منظر ۾ ڳالهائڻ کان وٺي گاڏي جي گوڙ تائين. جيستائين توهان جو آواز ڪلپ سمجھ ۾ اچي ٿو، اهو ڊيٽا سيٽ لاء ڪافي سٺو هجڻ گهرجي.
